tests/normal_benchmark.txt
// running 3 node servers
hey -n 1000000 -c 100 http://localhost:9000

Summary:
  Total:	48.3841 secs
  Slowest:	0.1063 secs
  Fastest:	0.0001 secs
  Average:	0.0048 secs
  Requests/sec:	20667.9475
  
  Total data:	11000000 bytes
  Size/request:	11 bytes

Response time histogram:
  0.000 [1]	|
  0.011 [951119]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.021 [46271]	|■■
  0.032 [1872]	|
  0.043 [460]	|
  0.053 [78]	|
  0.064 [30]	|
  0.074 [32]	|
  0.085 [46]	|
  0.096 [16]	|
  0.106 [75]	|


Latency distribution:
  10% in 0.0012 secs
  25% in 0.0025 secs
  50% in 0.0043 secs
  75% in 0.0064 secs
  90% in 0.0088 secs
  95% in 0.0106 secs
  99% in 0.0158 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.1063 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0098 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0606 secs
  resp wait:	0.0044 secs, 0.0000 secs, 0.0897 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0994 secs

Status code distribution:
  [200]	1000000 responses